### Terraform Plan Result

## Infrastructure (prod/infra)
```
digitalocean_reserved_ip.primary: Refreshing state... [id=138.197.236.79]
digitalocean_vpc.k8s: Refreshing state... [id=7b2d2bbd-ac3c-4add-9822-78e1a684e467]
tls_private_key.primary: Refreshing state... [id=483f06ce9559bc4f2bc651b6b6f94e8145eec011]
digitalocean_ssh_key.primary: Refreshing state... [id=48420182]
module.controlplane.digitalocean_droplet.control_plane: Refreshing state... [id=520045083]
module.controlplane.null_resource.wait_for_droplet: Refreshing state... [id=5347179057007684707]
module.controlplane.digitalocean_reserved_ip_assignment.public_ip: Refreshing state... [id=520045083-138.197.236.79-20250921231006217500000001]
module.controlplane.data.remote_file.kubeconfig: Reading...
module.controlplane.data.remote_file.kubeconfig: Read complete after 3s [id=206.189.160.10:22:/root/kubeconfig]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

```

## K8s (prod/k8s)
```
data.terraform_remote_state.infra: Reading...
module.certmanager.kubernetes_namespace_v1.cert_manager: Refreshing state... [id=cert-manager]
module.argocdsubdomain.data.cloudflare_zones.selected: Reading...
module.certmanager.helm_release.cert_manager: Refreshing state... [id=cert-manager]
module.argocdsubdomain.data.cloudflare_zones.selected: Read complete after 1s [name=haydenroszell.com]
data.terraform_remote_state.infra: Read complete after 1s
module.argocdsubdomain.cloudflare_dns_record.domain: Refreshing state... [id=9177e22e5858036dcbc71281c017087f]
module.certmanager.kubernetes_secret_v1.cloudflare_api_key: Refreshing state... [id=cert-manager/cloudflare-api-key]
module.certmanager.kubectl_manifest.cert_manager_cluster_issuer: Refreshing state... [id=/apis/cert-manager.io/v1/clusterissuers/letsencrypt]
module.argocd.kubernetes_namespace_v1.argocd: Refreshing state... [id=argo-cd]
module.argocd.tls_private_key.gitops: Refreshing state... [id=52f0e458aeb1f73c36f894600944cedcc83595e8]
module.argocd.github_repository_deploy_key.gitops: Refreshing state... [id=infra-gitops:132060232]
module.argocd.helm_release.argo_cd: Refreshing state... [id=argo-cd]
module.argocd.kubernetes_secret.argo_repo: Refreshing state... [id=argo-cd/infra-gitops]
module.database.kubernetes_namespace_v1.database: Refreshing state... [id=database]
module.database.kubernetes_secret_v1.postgres_database_secret: Refreshing state... [id=database/postgres-passwords]
module.database.kubectl_manifest.argo_appproject: Refreshing state... [id=/apis/argoproj.io/v1alpha1/namespaces/argo-cd/appprojects/database]
module.database.module.website_prod.kubectl_manifest.argo_application: Refreshing state... [id=/apis/argoproj.io/v1alpha1/namespaces/database/applications/database]
module.website.kubernetes_namespace_v1.staging: Refreshing state... [id=website-staging]
module.website.module.prod_domain.cloudflare_dns_record.domain: Refreshing state... [id=7279677475f69a20d018d816c78fc7c6]
module.website.kubectl_manifest.argo_appproject: Refreshing state... [id=/apis/argoproj.io/v1alpha1/namespaces/argo-cd/appprojects/website]
module.website.kubernetes_namespace_v1.prod: Refreshing state... [id=website-prod]
module.website.module.prod_www.cloudflare_dns_record.domain: Refreshing state... [id=db98fa577c350fa9942169346cdf2dba]
module.website.module.staging_domain.cloudflare_dns_record.domain: Refreshing state... [id=cc58b81ed410bbe661e8d11b7186add8]
module.website.module.ghcr_pull_secret.kubernetes_secret_v1.ghcr: Refreshing state... [id=website-staging/regcred]
module.website.module.prod_ghcr_pull_secret.kubernetes_secret_v1.ghcr: Refreshing state... [id=website-prod/regcred]
module.website.module.website_prod.kubectl_manifest.argo_application: Refreshing state... [id=/apis/argoproj.io/v1alpha1/namespaces/website-prod/applications/website-prod]
module.website.module.website_staging.kubectl_manifest.argo_application: Refreshing state... [id=/apis/argoproj.io/v1alpha1/namespaces/website-staging/applications/website-staging]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.database.module.website_prod.kubectl_manifest.argo_application will be updated in-place
  ~ resource "kubectl_manifest" "argo_application" {
        id                      = "/apis/argoproj.io/v1alpha1/namespaces/database/applications/database"
        name                    = "database"
      ~ yaml_body               = (sensitive value)
      ~ yaml_body_parsed        = <<-EOT
            apiVersion: argoproj.io/v1alpha1
            kind: Application
            metadata:
              annotations: {}
              name: database
              namespace: database
            spec:
              destination:
                namespace: database
                server: https://kubernetes.default.svc
              project: database
              source:
                helm:
                  valuesObject:
                    fullnameOverride: database
          -         postgres:
          +         postgresql:
                      auth:
                        enablePostgresUser: true
                        existingSecret: postgres-passwords
                        replicationUsername: repl-user
                        secretKeys:
                          adminPasswordKey: postgres-password
                          replicationPasswordKey: replication-password
                      fullnameOverride: database
                      primary:
                        extraEnvVarsSecret: postgres-passwords
                        initdb:
                          scripts:
                            init-user-db.sh: |
                              #!/bin/bash
                              set -e
                              export PGPASSWORD="$postgres-password"
                              psql -v ON_ERROR_STOP=1 --username "$POSTGRESQL_USERNAME" <<-EOSQL
                                CREATE DATABASE hydra_db;
                                CREATE USER hydra WITH PASSWORD '$HYDRA_PASSWORD';
                                GRANT ALL PRIVILEGES ON DATABASE hydra_db TO hydra;
            
                                \\c hydra_db
                                GRANT USAGE, CREATE ON SCHEMA public TO hydra;
                                ALTER DEFAULT PRIVILEGES IN SCHEMA public GRANT ALL ON TABLES TO hydra;
                              EOSQL
                path: prod/database
                repoURL: git@github.com:m8rmclaren/infra-gitops.git
                targetRevision: HEAD
              syncPolicy:
                automated:
                  prune: true
                  selfHeal: true
        EOT
        # (14 unchanged attributes hidden)
    }

  # module.website.module.prod_domain.data.cloudflare_zones.selected will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudflare_zones" "selected" {
      + match  = (known after apply)
      + name   = "haydenroszell.com"
      + result = (known after apply)
    }

  # module.website.module.prod_domain.cloudflare_dns_record.domain must be replaced
-/+ resource "cloudflare_dns_record" "domain" {
      ~ created_on  = "2025-09-21T23:17:16Z" -> (known after apply)
      ~ id          = "7279677475f69a20d018d816c78fc7c6" -> (known after apply)
      ~ meta        = jsonencode({}) -> (known after apply)
      ~ modified_on = "2025-09-21T23:17:16Z" -> (known after apply)
        name        = "haydenroszell.com"
      ~ proxiable   = true -> (known after apply)
      ~ settings    = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags        = []
      ~ zone_id     = "ae2642f28110cc1d459376bc73924f1a" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.website.module.prod_www.data.cloudflare_zones.selected will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudflare_zones" "selected" {
      + match  = (known after apply)
      + name   = "haydenroszell.com"
      + result = (known after apply)
    }

  # module.website.module.prod_www.cloudflare_dns_record.domain must be replaced
-/+ resource "cloudflare_dns_record" "domain" {
      ~ created_on  = "2025-09-21T23:17:17Z" -> (known after apply)
      ~ id          = "db98fa577c350fa9942169346cdf2dba" -> (known after apply)
      ~ meta        = jsonencode({}) -> (known after apply)
      ~ modified_on = "2025-09-21T23:17:17Z" -> (known after apply)
        name        = "www.haydenroszell.com"
      ~ proxiable   = true -> (known after apply)
      ~ settings    = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags        = []
      ~ zone_id     = "ae2642f28110cc1d459376bc73924f1a" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.website.module.staging_domain.data.cloudflare_zones.selected will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudflare_zones" "selected" {
      + match  = (known after apply)
      + name   = "haydenroszell.com"
      + result = (known after apply)
    }

  # module.website.module.staging_domain.cloudflare_dns_record.domain must be replaced
-/+ resource "cloudflare_dns_record" "domain" {
      ~ created_on  = "2025-09-21T23:17:17Z" -> (known after apply)
      ~ id          = "cc58b81ed410bbe661e8d11b7186add8" -> (known after apply)
      ~ meta        = jsonencode({}) -> (known after apply)
      ~ modified_on = "2025-09-21T23:17:17Z" -> (known after apply)
        name        = "stage.haydenroszell.com"
      ~ proxiable   = true -> (known after apply)
      ~ settings    = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags        = []
      ~ zone_id     = "ae2642f28110cc1d459376bc73924f1a" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
<!-- Sticky Pull Request Comment -->